---
kind: method
id: M:Autodesk.Revit.DB.RepeatingReferenceSource.Dispose
source: html/aa07145e-bace-7326-9e16-70a83d92a289.htm
---
# Autodesk.Revit.DB.RepeatingReferenceSource.Dispose Method

Releases all resources used by the RepeatingReferenceSource

## Syntax (C#)
```csharp
public void Dispose()
```